Repository: multilemon/lyrics_anki_app
Catalog: lib/l10n/arb/app_*.arb
Languages: id, ja, ko, my, ru, th, uz, vi, zh

# homeSubtitle
source: Learn Japanese from your favorite songs.
id: Belajar bahasa Jepang dari lagu favorit Anda.
ja: 好きな曲で日本語を学ぼう。
ko: 좋아하는 노래로 일본어를 배워보세요.
my: သင်အကြိုက်ဆုံးသီချင်းများမှ ဂျပန်စာလေ့လာပါ။
ru: Учите японский с помощью любимых песен.
th: เรียนภาษาญี่ปุ่นจากเพลงโปรดของคุณ
uz: Sevimli qoʻshiqlaringiz orqali yapon tilini oʻrganing.
vi: Học tiếng Nhật qua các bài hát yêu thích của bạn.
zh: 从你最喜欢的歌曲中学习日语。

source: Analyze New Song
id: Analisis Lagu Baru
ja: 新しい曲を分析
ko: 새 노래 분석
my: သီချင်းအသစ်လေ့လာရန်
ru: Анализ новой песни
th: วิเคราะห์เพลงใหม่
uz: Yangi qoʻshiqni tahlil qilish
vi: Phân tích bài hát mới
zh: 分析新歌

# songTitleLabel
source: Song Title
id: Judul Lagu
ja: 曲名
ko: 노래 제목
my: သီချင်းခေါင်းစဉ်
ru: Название песни
th: ชื่อเพลง
uz: Qoʻshiq nomi
vi: Tên bài hát
zh: 歌曲标题

# songTitleHint
source: e.g. Lemon
id: contoh: Lemon
ja: 例：Lemon
ko: 예: Lemon
my: ဥပမာ - Lemon
ru: например, Lemon
th: เช่น Lemon
uz: masalan: Lemon
vi: ví dụ: Lemon
zh: 例如：Lemon

# artistNameLabel
source: Artist Name
id: Nama Artis
ja: アーティスト名
ko: 아티스트 이름
my: အဆိုတော်အမည်
ru: Имя исполнителя
th: ชื่อศิลปิน
uz: Ijrochi
vi: Tên nghệ sĩ
zh: 艺术家姓名

# artistNameHint
source: e.g. Kenshi Yonezu
id: contoh: Kenshi Yonezu
ja: 例：米津玄師
ko: 예: 요네즈 켄시
my: ဥပမာ - Kenshi Yonezu
ru: например, Kenshi Yonezu
th: เช่น Kenshi Yonezu
uz: masalan: Kenshi Yonezu
vi: ví dụ: Kenshi Yonezu
zh: 例如：米津玄师

# targetLanguageLabel
source: Target Language
id: Bahasa Target
ja: 学習言語
ko: 목표 언어
my: ဘာသာစကားရွေးချယ်ရန်
ru: Целевой язык
th: ภาษาเป้าหมาย
uz: Maqsadli til
vi: Ngôn ngữ mục tiêu
zh: 目标语言

# analyzeButton
source: Analyze Song
id: Analisis Lagu
ja: 分析する
ko: 노래 분석
my: သီချင်းလေ့လာပါ
ru: Анализировать
th: วิเคราะห์เพลง
uz: Tahlil qilish
vi: Phân tích ngay
zh: 分析歌曲

# recentAnalysisTitle
source: Recent Analysis
id: Analisis Terbaru
ja: 最近の分析
ko: 최근 분석
my: လတ်တလောလေ့လာမှုများ
ru: Недавние анализы
th: ประวัติการวิเคราะห์
uz: Soʻnggi tahlillar
vi: Phân tích gần đây
zh: 最近分析

# noHistory
source: No history yet.
id: Belum ada riwayat.
ja: 履歴がありません。
ko: 기록이 없습니다.
my: မှတ်တမ်းမရှိသေးပါ။
ru: История пуста.
th: ยังไม่มีประวัติ
uz: Hozircha tarix yoʻq.
vi: Chưa có lịch sử.
zh: 尚无记录。

source: Unknown Artist
id: Artis Tidak Diketahui
ja: 不明なアーティスト
ko: 알 수 없는 아티스트
my: အဆိုတော်အမည်မသိပါ
ru: Неизвестный исполнитель
th: ไม่ทราบศิลปิน
uz: Nomaʼlum ijrochi
vi: Nghệ sĩ không xác định
zh: 未知艺术家

# settingsTitle
source: Settings
id: Pengaturan
ja: 設定
ko: 설정
my: ဆက်တင်များ
ru: Настройки
th: การตั้งค่า
uz: Sozlamalar
vi: Cài đặt
zh: 设置

source: UI Language
id: Bahasa Antarmuka
ja: アプリの言語
ko: UI 언어
my: အသုံးပြုမည့်ဘာသာစကား
ru: Язык интерфейса
th: ภาษาของแอป
uz: Ilova tili
vi: Ngôn ngữ ứng dụng
zh: 界面语言

source: Select Language
id: Pilih Bahasa
ja: 言語を選択
ko: 언어 선택
my: ဘာသာစကားရွေးချယ်ပါ
ru: Выберите язык
th: เลือกภาษา
uz: Tilni tanlang
vi: Chọn ngôn ngữ
zh: 选择语言

# analysisInProgress
source: Analysis in progress... This could take a few minutes.
id: Sedang menganalisis... Ini mungkin memakan waktu beberapa menit.
ja: 分析中... 数分かかる場合があります。
ko: 분석 중입니다... 몇 분 정도 걸릴 수 있습니다.
my: လေ့လာနေဆဲဖြစ်ပါသည်... မိနစ်အနည်းငယ်ကြာနိုင်ပါသည်။
ru: Идет анализ... Это может занять несколько минут.
th: กำลังวิเคราะห์... อาจใช้เวลาสักครู่
uz: Tahlil qilinmoqda... Bu bir necha daqiqa vaqt olishi mumkin.
vi: Đang phân tích... Quá trình này có thể mất vài phút.
zh: 正在分析... 这可能需要几分钟。

source: Song Not Found
id: Lagu Tidak Ditemukan
ja: 曲が見つかりません
ko: 노래를 찾을 수 없음
my: သီချင်းမတွေ့ပါ
ru: Песня не найдена
th: ไม่พบเพลง
uz: Qoʻshiq topilmadi
vi: Không tìm thấy bài hát
zh: 未找到歌曲

# songNotFoundMessage
source: We couldn't find lyrics for "{title}" by "{artist}". Please check if the name is correct.
id: Kami tidak dapat menemukan lirik untuk "{title}" oleh "{artist}". Silakan periksa apakah namanya benar.
ja: 「{artist}」の「{title}」の歌詞が見つかりませんでした。 名前が正しいか確認してください。
ko: "{artist}"의 노래 "{title}" 가사를 찾을 수 없습니다. 이름이 정확한지 확인해 주세요.
my: "{artist}" ၏ "{title}" သီချင်းစာသားကို ရှာမတွေ့ပါ။ အမည်မှန်ကန်ကြောင်း ပြန်လည်စစ်ဆေးပါ။
ru: Мы не нашли текст песни "{title}" исполнителя "{artist}". Пожалуйста, проверьте правильность названия.
th: เราไม่พบเนื้อเพลงสำหรับ "{title}" โดย "{artist}" โปรดตรวจสอบว่าชื่อถูกต้องหรือไม่
uz: "{artist}" ijrosidagi "{title}" qoʻshigʻi matni topilmadi. Iltimos, nom toʻgʻriligini tekshiring.
vi: Chúng tôi không tìm thấy lời bài hát cho "{title}" của "{artist}". Vui lòng kiểm tra lại tên.
zh: 我们找不到 "{artist}" 的歌曲 "{title}" 的歌词。 请检查名称是否正确。

# vocabTab
source: Vocab
id: Kosakata
ja: 単語
ko: 단어
my: ဝေါဟာရ
ru: Словарь
th: คำศัพท์
uz: Soʻzlar
vi: Từ vựng
zh: 词汇

# grammarTab
source: Grammar
id: Tata Bahasa
ja: 文法
ko: 문법
my: သဒ္ဒါ
ru: Грамматика
th: ไวยากรณ์
uz: Grammatika
vi: Ngữ pháp
zh: 语法

# kanjiTab
source: Kanji
ja: 漢字
ko: 한자
my: ခန်းဂျီး
ru: Кандзи
th: คันจิ
zh: 汉字

source: Watch on YouTube
id: Tonton di YouTube
ja: YouTubeで見る
ko: YouTube에서 보기
my: YouTube တွင်ကြည့်ပါ
ru: Смотреть на YouTube
th: ดูบน YouTube
uz: YouTube-da koʻrish
vi: Xem trên YouTube
zh: 在 YouTube 上观看

# searchLanguageHint
source: Search language...
id: Cari bahasa...
ja: 言語を検索...
ko: 언어 검색...
my: ဘာသာစကားရှာပါ...
ru: Поиск языка...
th: ค้นหาภาษา...
uz: Tilni qidirish...
vi: Tìm kiếm ngôn ngữ...
zh: 搜索语言...

# homeTab
source: Home
id: Beranda
ja: ホーム
ko: 홈
my: မူလစာမျက်နှာ
ru: Главная
th: หน้าแรก
uz: Bosh sahifa
vi: Trang chủ
zh: 首页

# lyricsTab
source: Lyrics
id: Lirik
ja: 歌詞
ko: 가사
my: သီချင်းစာသား
ru: Текст
th: เนื้อเพลง
uz: Qoʻshiq matni
vi: Lời bài hát
zh: 歌词

source: Export to Anki
id: Ekspor ke Anki
ko: Anki로 내보내기
ru: Экспорт в Anki
th: ส่งออกไปยัง Anki
vi: Xuất sang Anki
zh: 导出到 Anki

# generatingApkg
source: Generating .apkg file...
id: Membuat file .apkg...
ko: .apkg 파일 생성 중...
ru: Создание файла .apkg...
th: กำลังสร้างไฟล์ .apkg...
vi: Đang tạo tệp .apkg...
zh: 正在生成 .apkg 文件...

# selectJlptLevel
source: Select your JLPT Level:
id: Pilih Level JLPT Anda:
ko: JLPT 레벨 선택:
ru: Выберите ваш уровень JLPT:
th: เลือกระดับ JLPT ของคุณ:
vi: Chọn cấp độ JLPT của bạn:
zh: 选择您的 JLPT 等级：

# furiganaExplanation
source: Words above this level will include furigana on the front of the card.
id: Kata-kata di atas level ini akan menyertakan furigana di bagian depan kartu.
ko: 이 레벨 이상의 단어는 카드 앞면에 후리가나가 포함됩니다.
ru: Слова выше этого уровня будут содержать фуригану на лицевой стороне карточки.
th: คำศัพท์ที่สูงกว่าระดับนี้จะมีฟุริงานะที่ด้านหน้าของการ์ด
vi: Các từ trên cấp độ này sẽ bao gồm furigana ở mặt trước thẻ.
zh: 高于此等级的单词将在卡片正面显示注音。

# cancelButton
source: Cancel
id: Batal
ko: 취소
ru: Отмена
th: ยกเลิก
vi: Hủy
zh: 取消

# exportButton
source: Export
id: Ekspor
ko: 내보내기
ru: Экспорт
th: ส่งออก
vi: Xuất
zh: 导出
